[
 
  {
    "id": 0,
    "title": "PropertyPulse",
    "image": "https://i.ibb.co/N2T57b2T/Property-pulse.png",
    "shortDescription": "PropertyPulse is a React-based web application for Manage a Real estate Business Platform where A user can browse property,buy property,review,add wishlist,make payment,can offer price.Then A agent can see offer,sell property,add property,update,also can reject the offer.On the other hand,Admin can manage everything,make fraud,delete property,user,make advertisement and so on",
    "mainFeatures": [
      "Role-Based Dashboard & Access Control.Three distinct user roles: User, Agent, Admin.Each role gets a custom dashboard and can only access features relevant to their role.Admin/Agent routes are protected on the backend with middleware, ensuring security and data integrity.",
      "Reporting, Moderation, and Fraud Detection: Users can report properties (with modal, description, and auto-link to admin dashboard).Admins can view all reported properties and remove them (including all reviews).Fraud detection: Admins can mark agents as fraud, which disables their ability to add properties and removes their listings.",
      "Secure, Real Payment Integration: Stripe payment integration for secure, real-world property transactions.Payment status and transaction IDs are tracked and shown in the dashboard.Only verified offers can be paid for, ensuring a safe buying process.",
      "Modern, Interactive UI with Analytics: Live charts and statistics (using Recharts) for agents to visualize their sales.Animated, responsive UI with Swiper sliders, Framer Motion, and custom modals.Latest reviews, advertised properties, and extra sections make the homepage dynamic and engaging."
    ],
    "links": [
      {
        "name": "Live",
        "url": "https://pro-fast-curier.web.app/"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/Dev-Maidul/PropertyPulse-client"
      }
    ]
  },
  {
    "id": 1,
    "title": "Marathon Management System",
    "image": "https://i.ibb.co/sXbM9N6/hobby-hub-ef096-web-app.png",
    "shortDescription": "A React-based web application for scheduling and managing doctor appointments, allowing users to browse profiles, book/cancel appointments, and visualize data.",
    "mainFeatures": [
      "Users can browse comprehensive doctor profiles and book or cancel their appointments seamlessly.",
      "Real-time data visualization of appointment fees and statistics using Recharts.",
      "User-specific booking management with data persistence via localStorage."
    ],
    "links": [
      {
        "name": "Live",
        "url": "https://hobby-hub-ef096.web.app/"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/Dev-Maidul/Marathon-Management-client"
      }
    ]
  },
   {
    "id": 2,
    "title": "HobbyHub",
    "image": "https://i.ibb.co/3YQQM4Km/hobby-hubb-netlify-app-all-groups-1.png",
    "shortDescription": "A platform where people can discover and join local hobby-based groups (e.g., book clubs, hiking crews) or create their own to build communities around their passions.",
    "mainFeatures": [
      "Users can discover, join, or create hobby-based groups in their local area.",
      "Secure authentication system using Firebase with email/password, Google, and GitHub login.",
      "Personalized user dashboard to view and manage created or joined groups."
    ],
    "links": [
      {
        "name": "Live",
        "url": "https://hobby-hubb.netlify.app/"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/Dev-Maidul/Hobby-hub-client"
      }
    ]
  },
  {
    "id": 3,
    "title": "Prescription Point",
    "image": "https://i.ibb.co/wZgvgHqc/Prescription-point.png",
    "shortDescription": "A React-based web application for scheduling and managing doctor appointments. The platform allows users to browse doctor profiles, book and cancel appointments, visualize booking data, and explore helpful resources through a blog. Built with interactivity, responsive design, and data persistence in mind.",
    "mainFeatures": [
      "Doctor Details Page",
      "Doctor Booking based on Availability",
      "Appointment page with Rechart"
    ],
    "links": [
      {
        "name": "Live",
        "url": "https://prescription-point.netlify.app/"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/Dev-Maidul/Prescription-point"
      }
    ]
  }
]